UCB_CS61_lec26.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第二十六课 Binary Search Tree
#+PROPERTY: header-args:ipython :session 第二十六课 Binary Search Tree
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第二十六课 Binary Search Tree
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* disadvantage of binary search tree
#+BEGIN_QUOTE
If you have a _regular binary search tree_ and you just keep adding stuff to it,
it really gets thin and scrawny and then when you search, the search is going to
_take proportional to the number of elements in the tree_ (all node absolutely
in one 'line'), _instead of the O(logn)_ ,the difference between n and logn is
huge. So, it's true we have all this( _R&B-tree_ ) overhead and our red black
tree,but it guarantees us that out _height stays just 2logn_, 2logn is really
small compared to N and what's the _payoff_, all we have to do is _fix_ it
everytime we do an insertion when you do a regular binary search, it takes
O(logn) just to find the thing and this fixing(solve the problem trigged by
insertion and deleteion in R&B-tree) is taking just another _O(logn)_, _it's an
alternative to heap_
#+END_QUOTE
* Representing Binary Trees
Recall that a binary tree is a rooted tree wherein no node has more than two
children. Additionally, every child is either a _left_child_ or a _right_child_
of its parent, even if it is its parent's only child.

In the most popular binary tree representation, each tree node has three
references to neighboring tree nodes: a "parent" reference, and "left" and
"right" references for the two children. (For some algorithms, the "parent"
references are unnecessary.) Each node also has an "item" reference.

#+NAME: BinaryTree&BinaryTreeNode
#+BEGIN_SRC java
public class BinaryTreeNode {        |  public class BinaryTree {
  Object item;                       |    BinaryTreeNode root;
  BinaryTreeNode parent;             |    int size;
  BinaryTreeNode left;               |  }
  BinaryTreeNode right;              |

  public void inorder() {
    if (left != null) {
      left.inorder();
    }
    this.visit();
    if (right != null) {
      right.inorder();
    }
  }
}

#+END_SRC

#+BEGIN_EXAMPLE

               ================================================
               + BINARY TREE | -------------------            +
               =============== |---          --- |            +
               +               ||.|root  size|7| |            +
               +               |-+-          --- |            +
               +               --|----------------            +
               +                 v  BinaryTree object         +
               +               -----                          +
               +               | * |                          +
               +               -----             ------------ +
               + Root node =>  |add|             |  parent  | +
               +               -----             ------------ +
               +               |.|.|             |   item   | +
               +               /---\             ------------ +
               +              /  ^^ \            |left|right| +
               +             v  /  \ v           ------------ +
               +            ---/-  -\---         structure of +
               +            | . |  | . |      BinaryTreeNodes +
               +            -----  -----                      +
               +            |sub|  |div|                      +
               +            -----  -----                      +
               +           >|.|.|  |.|.|<                     +
               +          / /--|-  -|--\ \                    +
               +         / /  ^|    |^  \ \                   +
               +        / v   |v    v|   v \                  +
               +     --+--  --+--  --+--  --+--               +
               +     | . |  | . |  | . |  | . |               +
               +     -----  -----  -----  -----               +
               +     | 6 |  | 5 |  | 9 |  | 3 |               +
               +     -----  -----  -----  -----               +
               +     |*|*|  |*|*|  |*|*|  |*|*|               +
               +     -----  -----  -----  -----               +
               ================================================

#+END_EXAMPLE

