UCB_CS61_lec26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 22:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十六课 Binary Search Tree</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十六课 Binary Search Tree</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c2f421">1. disadvantage of binary search tree</a></li>
<li><a href="#org0b7b88e">2. Representing Binary Trees</a></li>
<li><a href="#org85c6da1">3. BINARY SEARCH TREES</a>
<ul>
<li><a href="#orga52bb18">3.1. Main api of binary search tree</a>
<ul>
<li><a href="#org15ca4c2">3.1.1. [1]  Entry find(Object k);</a></li>
<li><a href="#orgde38469">3.1.2. [2]  Entry min(); Entry max();</a></li>
<li><a href="#org14257cd">3.1.3. [3]  Entry insert(Object k, Object v);</a></li>
<li><a href="#orga7413e3">3.1.4. <span class="todo TODO">TODO</span> [4]  Entry remove(Object k);</a></li>
</ul>
</li>
<li><a href="#orgd2bbd9f">3.2. Running Times of Binary Search Tree Operations</a></li>
</ul>
</li>
<li><a href="#orgfdb5682">4. FootNote</a>
<ul>
<li><a href="#org955fbec">4.1. Footnote 1</a></li>
<li><a href="#orgd2bc685">4.2. Footnote 2</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org1c2f421" class="outline-2">
<h2 id="org1c2f421"><span class="section-number-2">1</span> disadvantage of binary search tree</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
If you have a <span class="underline">regular binary search tree</span> and you just keep adding stuff to it,
it really gets thin and scrawny and then when you search, the search is going to
<span class="underline">take proportional to the number of elements in the tree</span> (all node absolutely
in one 'line'), <span class="underline">instead of the O(logn)</span> ,the difference between n and logn is
huge. So, it's true we have all this( <span class="underline">R&amp;B-tree</span> ) overhead and our red black
tree,but it guarantees us that out <span class="underline">height stays just 2logn</span>, 2logn is really
small compared to N and what's the <span class="underline">payoff</span>, all we have to do is <span class="underline">fix</span> it
everytime we do an insertion when you do a regular binary search, it takes
O(logn) just to find the thing and this fixing(solve the problem trigged by
insertion and deleteion in R&amp;B-tree) is taking just another <span class="underline">O(logn)</span>, <span class="underline">it's an
alternative to heap</span>
</p>
</blockquote>
</div>
</div>
<div id="org0b7b88e" class="outline-2">
<h2 id="org0b7b88e"><span class="section-number-2">2</span> Representing Binary Trees</h2>
<div class="outline-text-2" id="text-2">
<p>
Recall that a binary tree is a rooted tree wherein no node has more than two
children. Additionally, every child is either a <span class="underline">left_child</span> or a <span class="underline">right_child</span>
of its parent, even if it is its parent's only child.
</p>

<p>
In the most popular binary tree representation, each tree node has three
references to neighboring tree nodes: a "parent" reference, and "left" and
"right" references for the two children. (For some algorithms, the "parent"
references are unnecessary.) Each node also has an "item" reference.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org4fcf04e"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">BinaryTreeNode</span> {        |  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> BinaryTree {
  <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">item</span>;                       |    BinaryTreeNode root;
  <span style="color: #ce537a; font-weight: bold;">BinaryTreeNode</span> <span style="color: #7590db;">parent</span>;             |    <span style="color: #ce537a; font-weight: bold;">int</span> size;
  <span style="color: #ce537a; font-weight: bold;">BinaryTreeNode</span> <span style="color: #7590db;">left</span>;               |  }
  <span style="color: #ce537a; font-weight: bold;">BinaryTreeNode</span> <span style="color: #7590db;">right</span>;              |

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> inorder() {
    <span style="color: #4f97d7; font-weight: bold;">if</span> (left != <span style="color: #a45bad;">null</span>) {
      left.inorder();
    }
    <span style="color: #4f97d7; font-weight: bold;">this</span>.visit();
    <span style="color: #4f97d7; font-weight: bold;">if</span> (right != <span style="color: #a45bad;">null</span>) {
      right.inorder();
    }
  }
}

</pre>
</div>

<pre class="example">

================================================
+ BINARY TREE | -------------------            +
=============== |---          --- |            +
+               ||.|root  size|7| |            +
+               |-+-          --- |            +
+               --|----------------            +
+                 v  BinaryTree object         +
+               -----                          +
+               | * |                          +
+               -----             ------------ +
+ Root node =&gt;  |add|             |  parent  | +
+               -----             ------------ +
+               |.|.|             |   item   | +
+               /---\             ------------ +
+              /  ^^ \            |left|right| +
+             v  /  \ v           ------------ +
+            ---/-  -\---         structure of +
+            | . |  | . |      BinaryTreeNodes +
+            -----  -----                      +
+            |sub|  |div|                      +
+            -----  -----                      +
+           &gt;|.|.|  |.|.|&lt;                     +
+          / /--|-  -|--\ \                    +
+         / /  ^|    |^  \ \                   +
+        / v   |v    v|   v \                  +
+     --+--  --+--  --+--  --+--               +
+     | . |  | . |  | . |  | . |               +
+     -----  -----  -----  -----               +
+     | 6 |  | 5 |  | 9 |  | 3 |               +
+     -----  -----  -----  -----               +
+     |*|*|  |*|*|  |*|*|  |*|*|               +
+     -----  -----  -----  -----               +
================================================

</pre>
</div>
</div>
