UCB_CS61_lec26.org
* BINARY SEARCH TREES
An _ordered_dictionary_ is a dictionary in which the keys have a total order,
just like in a heap. You can insert, find, and remove entries, just as with a
hash table, for more details, see lec-22 Dictionries-2 and Hash Table.

But unlike a hash table, you can quickly find the entry with minimum or maximum
key, or the entry nearest another entry <<1>> in the total order.

An ordered dictionary does anything a dictionary or binary heap can do and more,
albeit more slowly.

五种搜索结果：最大，最小，正好，比正好稍小（大）

[[1]] 的一个很好的例子是 spell 自动纠错，当你忘记某些单词的拼法，就打近似的，这样
binary search tree 可以帮你定位到相近的系统存储的单词中（the entry nearest
another entry）;当你处理的 key 是数字时，你可以这样搜索：give me the smallest
entry that's greater than or equal to 26.

binary search tree 的功能覆盖了 heap 和 hash table, 而且提供的更多，但是更慢。
#+BEGIN_EXAMPLE
+L_child <= parent <= R_child+
This is WRONG, insteaded:
L_descendent <= parent <= R_descendent
This is RIGHT!

A simple implementation of an ordered dictionary is a binary search tree,
                   wherein entries are maintained in a (somewhat) sorted order.
       18          The _left_subtree_ of a node is the subtree rooted at the
      /  \         node's left child; the _right_subtree_ is defined similarly.
    12    25       A binary search tree satisfies the _binary_search_tree_
   / \    / \      _invariant_:  for any node X, every key in the left subtree
  4  15  25  30    of X is less than or equal to X's key, and every key in the
 /  /  \    /      right subtree of X is greater than or equal to X's key.  You
1  13  17  28      can verify this in the search tree at left:  for instance,
 \  \       \      the root is 18, its left subtree (rooted at 12) contains
  3  14      29    numbers from 1 to 17, and its right subtree (rooted at 25)
                   contains numbers from 25 to 30.
#+END_EXAMPLE

When a node has only one child, that child is either a left child or a right
child, depending on whether its key is smaller or larger than its parent's key.
(A key equal to the parent's key can go into either subtree.)

** Main api of binary search tree
An inorder traversal of a binary search tree visits the nodes in sorted order.
In this sense, a search tree maintains a sorted list of entries. However,
operations on a search tree are usually more efficient than the same operations
on a sorted linked list.

Let's replace the "Object item;" declaration in each node with "Entry entry;"
where each Entry object stores a key and an associated value.

_The keys implement the Comparable interface_, and the key.compareTo() method
induces a total order on the keys (e.g. alphabetical or numerical order).

*** [1]  Entry find(Object k);

 #+NAME: whileLoop4find
 #+BEGIN_SRC java
public Entry find(Object k) {
  BinaryTreeNode node = root;                   // Start at the root.
  while (node != null) {
    int comp = ((Comparable) k).compareTo(node.entry.key());
    if (comp < 0) {                             // Repeatedly compare search
      node = node.left;                         // key k with current node; if
    } else if (comp > 0) {                      // k is smaller, go to the left
      node = node.right;                        // child; if k is larger, go to
    } else {    /* The keys are equal */        // the right child.  Stop when
      return node.entry;                        // we find a match (success;
    }                                           // return the entry) or reach
  }                                             // a null pointer (failure;
  return null;                                  // return null).
}
 #+END_SRC

 当你想精确的查找某个 entry，用 hashtable 会更有效率。

 This method only finds exact matches.  What if we want to find the smallest key
 greater than or equal to k, or the largest key less than or equal to k?
 Fortunately, when searching downward through the tree for a key k that is not
 in the tree, we are certain to encounter both
   - the node containing the smallest key greater than k (if any key is greater)
   - the node containing the largest key less than k (if any key is less).

 See [[*Footnote 1][Footnote 1]] for an explanation why.
     #+BEGIN_EXAMPLE
       +--+         For instance, suppose we search for the key 27 in the tree
       |18|         at left.  Along the way, we encounter the keys 25 and 28,
       /--\--+      which are the keys closest to 27 (below and above).
     12   |25|
    / \   +/-\--+   Here's how to implement a method smallestKeyNotSmaller(k):
   4  15  25 |30|   search for the key k in the tree, just like in find().
  /  /  \  +-/+-+   As you go down the tree, keep track of the smallest key
 1  13  17 |28|     not smaller than k that you've encountered so far.  If you
  \  \     +-\+     find the key k, you can return it immediately.  If you reach
   3  14      29    a null pointer, return the best key you found on the path.
                    You can implement largestKeyNotLarger(k) symmetrically.
     #+END_EXAMPLE

 很明显，如果你查找的 key 不在 binary search tree 中，你的搜索会‘路过’比你大的
 最小 entry 和比你小的最大 entry这时，你只需要在代码中增加两个变量分别记录‘比你
 小的最大值’和‘比你大的最小值’即可找到他们。or 你可以通过另一个 trick 找到两
 个值，就是最近的一次'choose left'和'choose right',以上图为例，最近一次‘向左’
 是28， 最近的一次向右是 25.通过在代码中记录并随时覆盖，就可以找到他们。（个人认
 为这种方法更好）
*** [2]  Entry min(); Entry max();

~min()~ is very simple. If the tree is empty, return null. Otherwise, start at
the root. Repeatedly go to the left child until you reach a node with no left
child. That node has the minimum key.

~max()~ is the same, except that you repeatedly go to the right child. In the
tree above, observe the locations of the minimum (1) and maximum (30) keys.

*** [3]  Entry insert(Object k, Object v);

~insert()~ starts by following the same path through the tree as find(). (find()
works _because_ it follows the same path as insert().) When it reaches a null
reference, replace that null with a reference to a new node storing the entry
(k, v).

Duplicate keys are allowed. If insert() finds a node that already has the key k,
it puts the new entry in the left subtree of the older one. (We could just as
easily choose the right subtree; it doesn't matter.)

