UCB_CS61_lec26.html

<div id="org85c6da1" class="outline-2">
<h2 id="org85c6da1"><span class="section-number-2">3</span> BINARY SEARCH TREES</h2>
<div class="outline-text-2" id="text-3">
<p>
An <span class="underline">ordered_dictionary</span> is a dictionary in which the keys have a total order,
just like in a heap. You can insert, find, and remove entries, just as with a
hash table, for more details, see lec-22 Dictionries-2 and Hash Table.
</p>

<p>
But unlike a hash table, you can quickly find the entry with minimum or maximum
key, or the entry nearest another entry <a id="orgd02b276"></a> in the total order.
</p>

<p>
An ordered dictionary does anything a dictionary or binary heap can do and more,
albeit more slowly.
</p>

<p>
五种搜索结果：最大，最小，正好，比正好稍小（大）
</p>

<p>
<a href="#orgd02b276">3</a> 的一个很好的例子是 spell 自动纠错，当你忘记某些单词的拼法，就打近似的，这样
binary search tree 可以帮你定位到相近的系统存储的单词中（the entry nearest
another entry）;当你处理的 key 是数字时，你可以这样搜索：give me the smallest
entry that's greater than or equal to 26.
</p>

<p>
binary search tree 的功能覆盖了 heap 和 hash table, 而且提供的更多，但是更慢。
</p>
<pre class="example">
+L_child &lt;= parent &lt;= R_child+
This is WRONG, insteaded:
L_descendent &lt;= parent &lt;= R_descendent
This is RIGHT!

A simple implementation of an ordered dictionary is a binary search tree,
                   wherein entries are maintained in a (somewhat) sorted order.
       18          The _left_subtree_ of a node is the subtree rooted at the
      /  \         node's left child; the _right_subtree_ is defined similarly.
    12    25       A binary search tree satisfies the _binary_search_tree_
   / \    / \      _invariant_:  for any node X, every key in the left subtree
  4  15  25  30    of X is less than or equal to X's key, and every key in the
 /  /  \    /      right subtree of X is greater than or equal to X's key.  You
1  13  17  28      can verify this in the search tree at left:  for instance,
 \  \       \      the root is 18, its left subtree (rooted at 12) contains
  3  14      29    numbers from 1 to 17, and its right subtree (rooted at 25)
                   contains numbers from 25 to 30.
</pre>

<p>
When a node has only one child, that child is either a left child or a right
child, depending on whether its key is smaller or larger than its parent's key.
(A key equal to the parent's key can go into either subtree.)
</p>
</div>

<div id="orga52bb18" class="outline-3">
<h3 id="orga52bb18"><span class="section-number-3">3.1</span> Main api of binary search tree</h3>
<div class="outline-text-3" id="text-3-1">
<p>
An inorder traversal of a binary search tree visits the nodes in sorted order.
In this sense, a search tree maintains a sorted list of entries. However,
operations on a search tree are usually more efficient than the same operations
on a sorted linked list.
</p>

<p>
Let's replace the "Object item;" declaration in each node with "Entry entry;"
where each Entry object stores a key and an associated value.
</p>

<p>
<span class="underline">The keys implement the Comparable interface</span>, and the key.compareTo() method
induces a total order on the keys (e.g. alphabetical or numerical order).
</p>
</div>

<div id="org15ca4c2" class="outline-4">
<h4 id="org15ca4c2"><span class="section-number-4">3.1.1</span> [1]  Entry find(Object k);</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-java" id="org066d816"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Entry</span> <span style="color: #bc6ec5; font-weight: bold;">find</span>(<span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">k</span>) {
  <span style="color: #ce537a; font-weight: bold;">BinaryTreeNode</span> <span style="color: #7590db;">node</span> = root;                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Start at the root.</span>
  <span style="color: #4f97d7; font-weight: bold;">while</span> (node != <span style="color: #a45bad;">null</span>) {
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">comp</span> = ((<span style="color: #ce537a; font-weight: bold;">Comparable</span>) k).compareTo(node.entry.key());
    <span style="color: #4f97d7; font-weight: bold;">if</span> (comp &lt; <span style="color: #a45bad;">0</span>) {                             <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Repeatedly compare search</span>
      node = node.left;                         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">key k with current node; if</span>
    } <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> (comp &gt; <span style="color: #a45bad;">0</span>) {                      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">k is smaller, go to the left</span>
      node = node.right;                        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">child; if k is larger, go to</span>
    } <span style="color: #4f97d7; font-weight: bold;">else</span> {    <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">The keys are equal */</span>        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">the right child.  Stop when</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> node.entry;                        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">we find a match (success;</span>
    }                                           <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return the entry) or reach</span>
  }                                             <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a null pointer (failure;</span>
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">null</span>;                                  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return null).</span>
}
</pre>
</div>

<p>
当你想精确的查找某个 entry，用 hashtable 会更有效率。
</p>

<p>
This method only finds exact matches.  What if we want to find the smallest key
greater than or equal to k, or the largest key less than or equal to k?
Fortunately, when searching downward through the tree for a key k that is not
in the tree, we are certain to encounter both
</p>
<ul class="org-ul">
<li>the node containing the smallest key greater than k (if any key is greater)</li>
<li>the node containing the largest key less than k (if any key is less).</li>
</ul>

<p>
See <a href="#org955fbec">Footnote 1</a> for an explanation why.
</p>
<pre class="example">
      +--+         For instance, suppose we search for the key 27 in the tree
      |18|         at left.  Along the way, we encounter the keys 25 and 28,
      /--\--+      which are the keys closest to 27 (below and above).
    12   |25|
   / \   +/-\--+   Here's how to implement a method smallestKeyNotSmaller(k):
  4  15  25 |30|   search for the key k in the tree, just like in find().
 /  /  \  +-/+-+   As you go down the tree, keep track of the smallest key
1  13  17 |28|     not smaller than k that you've encountered so far.  If you
 \  \     +-\+     find the key k, you can return it immediately.  If you reach
  3  14      29    a null pointer, return the best key you found on the path.
                   You can implement largestKeyNotLarger(k) symmetrically.
</pre>

<p>
很明显，如果你查找的 key 不在 binary search tree 中，你的搜索会‘路过’比你大的最小 entry 和比你小的最大 entry这时，你只需要在代码中增加两个变量分别记录‘比你小的最大值’和‘比你大的最小值’即可找到他们。or 你可以通过另一个 trick 找到两个值，就是最近的一次'choose left'和'choose right',以上图为例，最近一次‘向左’是28， 最近的一次向右是 25.通过在代码中记录并随时覆盖，就可以找到他们。（个人认为这种方法更好）
</p>
</div>
</div>
<div id="orgde38469" class="outline-4">
<h4 id="orgde38469"><span class="section-number-4">3.1.2</span> [2]  Entry min(); Entry max();</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<code>min()</code> is very simple. If the tree is empty, return null. Otherwise, start at
the root. Repeatedly go to the left child until you reach a node with no left
child. That node has the minimum key.
</p>

<p>
<code>max()</code> is the same, except that you repeatedly go to the right child. In the
tree above, observe the locations of the minimum (1) and maximum (30) keys.
</p>
</div>
</div>

<div id="org14257cd" class="outline-4">
<h4 id="org14257cd"><span class="section-number-4">3.1.3</span> [3]  Entry insert(Object k, Object v);</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<code>insert()</code> starts by following the same path through the tree as find(). (find()
works <span class="underline">because</span> it follows the same path as insert().) When it reaches a null
reference, replace that null with a reference to a new node storing the entry
(k, v).
</p>

<p>
Duplicate keys are allowed. If insert() finds a node that already has the key k,
it puts the new entry in the left subtree of the older one. (We could just as
easily choose the right subtree; it doesn't matter.)
</p>
</div>
</div>
