UCB_CS61_lec26.html

<div id="orga7413e3" class="outline-4">
<h4 id="orga7413e3"><span class="section-number-4">3.1.4</span> <span class="todo TODO">TODO</span> [4]  Entry remove(Object k);</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
If the node is a leaf then you just deleted.
If the node is an internal node, then you find its successor or predeccessor,
you swap and then you delete the successor or predeccessor. And , this successor(suppose it is)
cannot have a right child, if it has, then the left child should be the successor.
So, what we really do about deleting , <span class="underline">we just delete a leaf or a leaf' partent</span>
</p>

<p>
删除要分三种情况，待删节点没有孩子，只有一个孩子，有两个孩子有两个孩子就删除其 successor, 其 successor 肯定没有左孩子 or 干脆没孩子，因为如果有左孩子说明排序是这样的，待删&lt;'successor_L'&lt;successor&lt;successor_R因为是直接后继（successor）, 所以 successor 肯定没有左孩子
</p>

<p>
If it has 2 children, i went to the successor of that node, I copied the
content of this successor into that node then, I deleted the successor.
The actual node I deleted was the successor node and successor node has
only one or no children
</p>

<p>
所以删除带有两个孩子的节点，实际就归结为 ‘有一个孩子的’ or ‘没有孩子的’两个问题。AVL-tree Splay-tree 的所有操作，其实跟这里的 binary search tree
的操作很相似,不同的是都要 avl 和 splay 都要 rotation
</p>

<p>
<code>remove()</code> is the most difficult operation. First, find a node with key k using
the same algorithm as find(). Return null if k is not in the tree; otherwise,
let n be the first node with key k.
</p>

<ol class="org-ol">
<li>If n has no children, we easily detach it from its parent and throw it away.</li>
<li>If n has one child, move n's child up to take n's place.  n's parent becomes
the parent of n's child, and n's child becomes the child of n's parent.Dispose of n.</li>
<li><p>
If n has two children, however, we have to be a bit more clever.  Let x be the
node in n's right subtree with the smallest key.  Remove x; since x has the
minimum key in the subtree, x has no left child and is easily removed.
Finally, replace n's entry with x's entry.  x has the key closest to k that
isn't smaller than k, so the binary search tree invariant still holds.
</p>

<p>
这里使用了一种‘步进’的方式，把'two child'问题，转换为'one child'问题：如果待删节点有左右两个子树，那么选择右子树中最小的节点（比待删节点大的节点中最小的）与待删节点互换，互换的方法分两步：
</p>
<ol class="org-ol">
<li>用‘if n has one child’方法删除这个最小的节点，因为这个节点肯定没有左子树；</li>
<li>用这个节点替换待删节点</li>
</ol></li>
</ol>


<pre class="example">
       18                          18                            18
      /  \                        /  \                          /  \
    12    25                    12    25                      12    25
   / \    / \                  / \    / \                    / \    / \
  4  15  25  30 -insert(2)-&gt;  4  15  25  30 -remove(30)-&gt;   4  15  25  28
 /  /  \    /                /  /  \    /                  /  /  \      \
1  13  17  28               1  13  17  28                 1  13  17      29
 \  \       \                \  \       \                  \  \
  3  14      29               3  14      29                 3  14
                             /                             /
                            2                             2

                          18                   18
                      +--/  \                 /  \
                      |12|   25             13    25
                      /-\+   / \           / \    / \
     -remove(12)-&gt;   4  15  25  28   -&gt;   4  15  25  28
                    /+-/+ \      \       /  /  \      \
                   1 |13| 17      29    1  14  17      29
                    \+-\+                \
                     3  14                3
                    /                    /
                   2                    2
</pre>

<p>
To ensure you understand the binary search tree operations, especially
remove(), I recommend you inspect Goodrich and Tamassia's code on page 446.
Be aware that Goodrich and Tamassia use sentinel nodes for the leaves of
their binary trees; I think these waste an unjustifiably large amount of space.
</p>

<pre class="example">
[TODO] 这个 remove()一定要注意：
    2
   / --\
  1    7
      / \
     5   8
    /
   4
</pre>
<p>
比如这里要删除 root 2, 但是 2 有左右子树，不能直接删除，要删除 nearest higher:4
先用 4 replace 2, 然后把带有 4 的 node 删除, 问题是，这个 node 是否是字典型 node，包含 value 和 key 的？这里树中的数字明显是 key，那么如果仅仅是“用 key4 去替换
key2”，那么是不是就改变了原来的 key:value 对了？
</p>
</div>
</div>
</div>
<div id="orgd2bbd9f" class="outline-3">
<h3 id="orgd2bbd9f"><span class="section-number-3">3.2</span> Running Times of Binary Search Tree Operations</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
                                                                    1
     o       In a perfectly balanced binary tree (left) with         \
    / \      height h, the number of nodes n is 2^(h+1) - 1.          2
   o   o     (See Footnote 2.)  Therefore, no node has depth           \
  /\   /\    greater than log_2 n.  The running times of                3
 o o   o o   find(), insert(), and remove() are all proportional         \
/\ /\ /\ /\  to the depth of the last node encountered, so they all run   4
oo oo oo oo  in _O(log n)_ worst-case time on a perfectly balanced tree.   \
                                                                            5
On the other hand, it's easy to form a severely imbalanced tree like         \
the one at right, wherein these operations will usually take linear time.     6
That's _O(n)_.

</pre>

<p>
There's a vast middle ground of binary trees that are reasonably well-balanced,
albeit certainly not perfectly balanced, for which search tree operations will
run in O(log n) time.  You may need to resort to experiment to determine
whether any particular application will use binary search trees in a way that
tends to generate somewhat balanced trees or not.  If you create a binary
search trees by inserting keys in a randomly chosen order, or if the keys are
generated by a random process from the same distribution, then with high
probability  the tree will have height O(log n), and operations on the tree
will take O(log n) time.
</p>

<p>
Unfortunately, there are occasions where you might fill a tree with entries
that happen to be already sorted.  In this circumstance, you'll create the
disastrously imbalanced tree depicted at right.  Technically, all operations on
binary search trees have Theta(n) worst-case running time.
</p>

<p>
For this reason, researchers have developed a variety of algorithms for keeping
search trees balanced.  Prominent examples include 2-3-4 trees (which we'll
cover next lecture), splay trees (in one month), and B-trees (in CS 186).
</p>
</div>
</div>
</div>
<div id="orgfdb5682" class="outline-2">
<h2 id="orgfdb5682"><span class="section-number-2">4</span> FootNote</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="org955fbec" class="outline-3">
<h3 id="org955fbec"><span class="section-number-3">4.1</span> Footnote 1</h3>
<div class="outline-text-3" id="text-4-1">
<p>
    When we search for a key k not in the binary search tree, why are we
guaranteed to encounter the two keys that bracket it? Let x be the smallest key
in the tree greater than k. Because k and x are "adjacent" keys, the result of
comparing k with any other key y in the tree is the same as comparing x with y.
Hence, find(k) will follow exactly the same path as find(x) until it reaches x.
(After that, it may continue downward.) The same argument applies to the largest
key less than k.
</p>
</div>
</div>

<div id="orgd2bc685" class="outline-3">
<h3 id="orgd2bc685"><span class="section-number-3">4.2</span> Footnote 2</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A perfectly balanced binary tree has 2^i nodes at depth i, where
</p>

<pre class="example">
                                                   h   i    h+1
0 &lt;= i &lt;= h.  Hence, the total number of nodes is Sum 2  = 2    - 1.
                                                  i=0
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
